//Написати гру «Бики та корови».Програма «загадує» чотиризначне число і гравець має вгадати його.
//Після введення користувачем числа програма повідомляє,скільки цифр числа вгадано(бики) і скільки цифр вгадано
//і стоїть на потрібному місці(корови).Після відгадування числа на екран необхідно вивести кількість зроблених
//користувачем спроб
#include <iostream>
#include <ctime>
using namespace std;

int main()
{
    srand(time(0));
    int arr[4];
    cout << "Generating number." << endl;
    for (int i = 0; i < 4; i++)
    {
        arr[i] = rand() % 9;
    }
    if (arr[0] == 0) arr[0] = rand () % 8 + 1;
    cout << "Incert number: " << endl;

    return 0;
}


